{
  "architectures": [
    "ToyTransLMHeadModel"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_toytrans.ToyTransConfig",
    "AutoModel": "modeling_toytrans.ToyTransModel",
    "AutoModelForCausalLM": "modeling_toytrans.ToyTransLMHeadModel"
  },
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "model_type": "toytrans",
  "n_ctx": 40,
  "n_embd": 40,
  "n_head": 1,
  "n_layer": 1,
  "n_positions": 40,
  "summary_activation": null,
  "summary_first_dropout": 0.1,
  "summary_proj_to_labels": true,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "task_specific_params": {
    "text-generation": {
      "do_sample": true,
      "max_length": 20
    }
  },
  "vocab_size": 40

}
